src/CF/Documents/ПеремещенияТовара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Document>
		<Properties>
			<Name>ПеремещенияТовара</Name>
			<BasedOn>
				<xr:Item>Document.ПоступленияТовара</xr:Item>
				<xr:Item>Document.КорректировкиИРегистрацияОстатков</xr:Item>
				<xr:Item>Document.УстановкиЦен</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Товары</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладКуда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1020</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТовараНаСумму</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТовараВКоличестве</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОСтроке</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/CF/AccumulationRegisters/Товары.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<AccumulationRegister>
		<Properties>
			<Name>Товары</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СписаниеИлиОприходование</Name>
					<Comment>Списание или оприходование (не приобретение, продажа, возврат или перемещение)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/CF/Enums/ИгнорироватьРазрешитьЗапретить.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Enum>
		<Properties>
			<Name>ИгнорироватьРазрешитьЗапретить</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Игнорировать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РазрешитьНоПредупредить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Запретить</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/CF/Documents/ПеремещенияТовара/Ext/ObjectModule.bsl
//sza140115-1111 : 
//sza130915-1930 : 

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если НЕ Отказ Тогда
		
		движения.Товары.Записать();
		
		ПоведениеПрограммыПриРасходеТоваровНижеРекомендованногоМинимальногоОстатка = ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ПоведениеПрограммыПриРасходеТоваровНижеРекомендованногоМинимальногоОстатка");
		ПоведениеПрограммыПриРасходеТоваровБезОстатка = ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ПоведениеПрограммыПриРасходеТоваровБезОстатка");
		ВидДвиженияНакопленияРасход = ВидДвиженияНакопления.Расход;
		ВидДвиженияНакопленияПриход = ВидДвиженияНакопления.Приход;
		
		ОстаткиСледуетПроверять = (ЗначениеЗаполнено(ПоведениеПрограммыПриРасходеТоваровНижеРекомендованногоМинимальногоОстатка)
		И НЕ ПоведениеПрограммыПриРасходеТоваровНижеРекомендованногоМинимальногоОстатка = Перечисления.ИгнорироватьРазрешитьЗапретить.Игнорировать )
		ИЛИ (ЗначениеЗаполнено(ПоведениеПрограммыПриРасходеТоваровБезОстатка)
		И НЕ ПоведениеПрограммыПриРасходеТоваровБезОстатка = Перечисления.ИгнорироватьРазрешитьЗапретить.Игнорировать) ;
		
		СтруктураТаблиц 	= ОбщийМодульСервер.ПолучитьТаблицыЦенСписанияИОстатков(ссылка, склад, дата, ОстаткиСледуетПроверять);
		ТаблицаЦенСписания  = СтруктураТаблиц.ТаблицаЦенСписания;
		если ОстаткиСледуетПроверять тогда
			ГТ = СтруктураТаблиц.ТаблицаОстатков;	
		КонецЕсли;
		
		Для Каждого ТекСтрокаТовары Из Товары Цикл
			
			Номенклатура = ТекСтрокаТовары.Номенклатура;
			НоменклатураПредопределенный = ОбщийМодульПовтор.ТоварНеУчитываетсяПоКоличеству(Номенклатура);
			КомментарийСтроки = ?(ЗначениеЗаполнено(текстрокатовары.ОСтроке), текстрокатовары.ОСтроке, Комментарий);
			
			СуммаОстаток 	  = 0;
			КоличествоОстаток = 0;
			
			если ОстаткиСледуетПроверять тогда
				СтрокаОстаток = ГТ.найти(номенклатура, "Номенклатура");
				Если не СтрокаОстаток = Неопределено Тогда
					КоличествоОстаток = СтрокаОстаток.КоличествоОстаток;
					СуммаОстаток = СтрокаОстаток.СуммаОстаток;
				КонецЕсли;
			КонецЕсли;
			
			Если ОстаткиСледуетПроверять
				и НЕ НоменклатураПредопределенный
				и НЕ ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ПриАвтоматическомПерепроведенииДокументовОтменитьПроверкиНаОтказ") Тогда
				
				Отказ = ОбщийМодульСервер.ПроверитьОстатокТоваров(ПоведениеПрограммыПриРасходеТоваровНижеРекомендованногоМинимальногоОстатка, ПоведениеПрограммыПриРасходеТоваровБезОстатка, Склад, Номенклатура, ТекСтрокаТовары.Количество, Дата, Истина, КоличествоОстаток, Ссылка);
			КонецЕсли;				
			
			если не отказ тогда
				Если ОбщийМодульПовтор.ЭтоНабор(Номенклатура) Тогда				
					отказ = обработатьдвижениядлянабора(Отказ, Номенклатура, ТекСтрокаТовары.Количество, ТекСтрокаТовары.Сумма, ПоведениеПрограммыПриРасходеТоваровНижеРекомендованногоМинимальногоОстатка, ПоведениеПрограммыПриРасходеТоваровБезОстатка);
					
				ИначеЕсли НЕ НоменклатураПредопределенный Тогда
					
					СтруктураОстатка = новый Структура;
					СтруктураОстатка.Вставить("Количество", КоличествоОстаток);
					СтруктураОстатка.Вставить("Сумма", СуммаОстаток);
					
					Движение = Движения.Товары.Добавить(); 				
					Движение.Количество 	= ТекСтрокаТовары.Количество;						
					Движение.ВидДвижения 	= ВидДвиженияНакопленияРасход;
					Движение.Период 		= Дата;
					Движение.Номенклатура 	= Номенклатура;
					Движение.СерияНоменклатуры = ТекСтрокаТовары.СерияНоменклатуры;
					Движение.Склад 			= Склад;
					Движение.Комментарий	= КомментарийСтроки;
					
					если не ТаблицаЦенСписания = Неопределено тогда
						СтрокаЦеныСписания = ТаблицаЦенСписания.найти(номенклатура, "Номенклатура");
						Если не СтрокаЦеныСписания = Неопределено Тогда
							ЦенаСписания = СтрокаЦеныСписания.Цена;
						иначе
							ЦенаСписания = ОбщийМодульСервер.ПолучитьЦенуНаСервере(номенклатура, истина, дата, ложь, , , , , Ссылка);
						КонецЕсли;
					иначе
						ЦенаСписания = ОбщийМодульСервер.ПолучитьЦенуНаСервере(номенклатура, истина, дата, ложь, , , , , Ссылка);
					КонецЕсли;
					
					СуммаСписания = ЦенаСписания * ТекСтрокаТовары.Количество;
					Движение.Сумма = СуммаСписания;					
					
					Движение = Движения.Товары.Добавить();
					Движение.ВидДвижения 	= ВидДвиженияНакопленияПриход;
					Движение.Период 		= Дата;
					Движение.Номенклатура 	= Номенклатура;
					Движение.СерияНоменклатуры = ТекСтрокаТовары.СерияНоменклатуры;
					Движение.Склад 			= СкладКуда;					
					Движение.Количество 	= ТекСтрокаТовары.Количество;					
					Движение.Сумма 			= СуммаСписания;
					Движение.Комментарий	= КомментарийСтроки;
					
				КонецЕсли;
			КонецЕсли;		
		КонецЦикла;	
	КонецЕсли;
	
	движения.Товары.Записывать = НЕ Отказ;
	
КонецПроцедуры

Функция   обработатьдвижениядлянабора(Отказ, Номенклатура, КоличествоВх, Сумма = 0, ПоведениеПрограммыПриРасходеТоваровНижеРекомендованногоМинимальногоОстатка, ПоведениеПрограммыПриРасходеТоваровБезОстатка) //для вложенных наборов
	
	общкво = Номенклатура.Состав.Итог("Количество");
	Если общкво = 0 Тогда
		общкво = 1;
	КонецЕсли;
	
	для каждого СтрокаСоставаНабора из Номенклатура.Состав цикл
		
		НоменклатураСостава = СтрокаСоставаНабора.Номенклатура;
		Количество = КоличествоВх * СтрокаСоставаНабора.Количество;	
		
		СуммаЭлемента = 0; //СуммаЭлемента при перемещении принебречь
		
		Если НоменклатураСостава.ЭтоНабор = ИСТИНА Тогда
			обработатьдвижениядлянабора(Отказ, НоменклатураСостава, КоличествоВх * СтрокаСоставаНабора.количество, СуммаЭлемента, ПоведениеПрограммыПриРасходеТоваровНижеРекомендованногоМинимальногоОстатка, ПоведениеПрограммыПриРасходеТоваровБезОстатка);
		иначе
			
			ЭлементПредопределенный = ОбщийМодульПовтор.ТоварНеУчитываетсяПоКоличеству(НоменклатураСостава);
			
			если не ЭлементПредопределенный тогда
				
				Отказ = ОбщийМодульСервер.ПроверитьОстатокТоваров(ПоведениеПрограммыПриРасходеТоваровНижеРекомендованногоМинимальногоОстатка, ПоведениеПрограммыПриРасходеТоваровБезОстатка, Склад, НоменклатураСостава, Количество, Дата, Истина, , Ссылка);
				
				если не отказ тогда
					Движение = Движения.Товары.Добавить();													
					Движение.Количество 	= Количество;	
					Движение.ВидДвижения 	= ВидДвиженияНакопления.Расход;
					Движение.Период 		= Дата;
					Движение.Номенклатура 	= НоменклатураСостава;
					Движение.Склад 			= Склад;
					ЦенаСписания  = ОбщийМодульСервер.ПолучитьЦенуСписания(НоменклатураСостава, Количество, Дата);
					СуммаСписания = ЦенаСписания * Количество;
					Движение.Сумма = СуммаСписания;
					
					Движение = Движения.Товары.Добавить();
					Движение.ВидДвижения 	= ВидДвиженияНакопления.Приход;
					Движение.Период 		= Дата;
					Движение.Номенклатура 	= НоменклатураСостава;
					Движение.Склад 			= СкладКуда;
					Движение.Количество	 	= Количество;						
					Движение.Сумма			= СуммаСписания;     	
				КонецЕсли;		
			КонецЕсли;		
		КонецЕсли;					
	КонецЦикла;	
	
	Возврат Отказ;
	
КонецФункции

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	если не отказ 
		и Модифицированность()
		и РежимЗаписи = РежимЗаписиДокумента.Проведение тогда
		
		Если НЕ ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ПриАвтоматическомПерепроведенииДокументовОтменитьПроверкиНаОтказ") Тогда
			ПодготовкаКПроведению(Отказ);	
		КонецЕсли;
		
		если не отказ
			и ТовараВКоличестве = 0
			и РежимЗаписи = РежимЗаписиДокумента.Проведение тогда
			
			РежимЗаписи = РежимЗаписиДокумента.Запись;
		КонецЕсли;	
		
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПодготовкаКПроведению(Отказ) Экспорт
	
	если не ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("НеСворачиватьТоварыПоКоличествуВоВсехДокументах") тогда
		Товары.Свернуть("Номенклатура, СерияНоменклатуры, Цена", "Количество, Сумма");	
	КонецЕсли;
	
	массивпустыхстрок 	= новый массив;
	массивноменклатуры 	= Новый массив;
	
	для каждого СтрокаТовары из товары цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТовары.Номенклатура) Тогда     				
			массивпустыхстрок.Добавить(СтрокаТовары);
			
		ИначеЕсли СтрокаТовары.Номенклатура.НеОтслеживатьОстаток Тогда
			
			если ОбщийМодульПовторВТеченииСервера.ВыводитьСообщенияМожно() тогда
				//Сообщение = Новый СообщениеПользователю;
				//Сообщение.Текст = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("В строке №") + " " + СтрокаТовары.НомерСтроки + символы.ПС + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("попытка перенести номенклатуру, которая не учитывается по количеству:") + " " + СтрокаТовары.Номенклатура;
				//Сообщение.Сообщить();	
				ОбщийМодульСервисСервер.ДобавитьСообщениеПользователю(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("В строке №") + " " + СтрокаТовары.НомерСтроки + символы.ПС + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("попытка перенести номенклатуру, которая не учитывается по количеству:") + " " + СтрокаТовары.Номенклатура, , Ссылка);
			КонецЕсли;
			
			Отказ = Истина;
			
		иначеесли не массивноменклатуры.Найти(СтрокаТовары.Номенклатура) = Неопределено тогда
			
			если ОбщийМодульПовторВТеченииСервера.ВыводитьСообщенияМожно() тогда
				//Сообщение = Новый СообщениеПользователю;
				//Сообщение.Текст = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("В строке №") + " " + СтрокаТовары.НомерСтроки + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке(" повторяется номенклатура:") + " " + СтрокаТовары.Номенклатура;
				//Сообщение.Сообщить();
				ОбщийМодульСервисСервер.ДобавитьСообщениеПользователю(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("В строке №") + " " + СтрокаТовары.НомерСтроки + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке(" повторяется номенклатура:") + " " + СтрокаТовары.Номенклатура, , Ссылка);
			КонецЕсли;				
			
		иначе
			массивноменклатуры.Добавить(СтрокаТовары.Номенклатура);
			
		КонецЕсли;                                    	
	КонецЦикла;
	
	Если НЕ Отказ Тогда
		
		для каждого СтрокаТовары из массивпустыхстрок цикл
			товары.Удалить(СтрокаТовары);	
		КонецЦикла;
		
		если Склад = СкладКуда тогда
			если ОбщийМодульПовторВТеченииСервера.ВыводитьСообщенияМожно() тогда
				//Сообщение = Новый СообщениеПользователю;
				//Сообщение.Текст = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Нельзя выбирать в качестве источника и получателя один склад!");
				//Сообщение.Сообщить();                                               	
				ОбщийМодульСервисСервер.ДобавитьСообщениеПользователю(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Нельзя выбирать в качестве источника и получателя один склад!"), , Ссылка);
			КонецЕсли;
			отказ = истина;		
			
		иначе
			ОбщийМодульТоварСервер.ПроверитьИСортироватьТаблицуТовары(ЭтотОбъект);
			
			ТовараВКоличестве = товары.итог("Количество");
			Если ЗначениеЗаполнено(ВидЦен) Тогда
				ТовараНаСумму = ОбщийМодульСервер.ПоКурсу(товары.Итог("Сумма"), ВидЦен.ВалютаЦены, , Дата);
			Иначе
				ТовараНаСумму = товары.Итог("Сумма");
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		
		Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступленияТовара") Тогда
			Комментарий 		= ДанныеЗаполнения.Комментарий;
			Склад 				= ДанныеЗаполнения.Склад;
			ВидЦен 				= ДанныеЗаполнения.ВидЦен;
			ТовараВКоличестве 	= ДанныеЗаполнения.ТовараВКоличестве;
			ТовараНаСумму 		= ДанныеЗаполнения.ТовараНаСумму;
			
			Для Каждого ТекСтрокаТовары Из ДанныеЗаполнения.Товары Цикл
				НоваяСтрока = Товары.Добавить();
				НоваяСтрока.Номенклатура 	= ТекСтрокаТовары.Номенклатура;
				НоваяСтрока.СерияНоменклатуры = ТекСтрокаТовары.СерияНоменклатуры;
				НоваяСтрока.Количество 		= ТекСтрокаТовары.Количество;
				НоваяСтрока.Цена 			= ТекСтрокаТовары.Цена;
				НоваяСтрока.Сумма 			= ТекСтрокаТовары.Сумма;
			КонецЦикла;
			
		ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.КорректировкиИРегистрацияОстатков") Тогда
			Комментарий 		= ДанныеЗаполнения.Комментарий;
			ВидЦен 				= ДанныеЗаполнения.ВидЦен;
			ТовараВКоличестве 	= ДанныеЗаполнения.ТовараВКоличестве;
			ТовараНаСумму 		= ДанныеЗаполнения.ТовараНаСумму;
			
			Для Каждого ТекСтрокаТовары Из ДанныеЗаполнения.Товары Цикл
				НоваяСтрока = Товары.Добавить();
				НоваяСтрока.Номенклатура 	= ТекСтрокаТовары.Номенклатура;
				НоваяСтрока.СерияНоменклатуры = ТекСтрокаТовары.СерияНоменклатуры;
				НоваяСтрока.Количество 		= ТекСтрокаТовары.Количество;
				НоваяСтрока.Цена 			= ТекСтрокаТовары.Цена;
				НоваяСтрока.Сумма 			= НоваяСтрока.Цена * НоваяСтрока.Количество ;
			КонецЦикла;
			
		ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.УстановкиЦен") Тогда
			Комментарий = ДанныеЗаполнения.Комментарий;
			ВидЦен 		= ДанныеЗаполнения.ВидЦен;
			Для Каждого ТекСтрокаТовары Из ДанныеЗаполнения.Товары Цикл
				НоваяСтрока = Товары.Добавить();
				НоваяСтрока.Количество 		= 1;
				НоваяСтрока.Номенклатура 	= ТекСтрокаТовары.Номенклатура;
				НоваяСтрока.Цена 			= ТекСтрокаТовары.Цена;
				НоваяСтрока.Сумма 			= НоваяСтрока.Цена *НоваяСтрока.Количество;
			КонецЦикла;
			
		КонецЕсли;	
		
		ТовараВКоличестве 	= Товары.Итог("Количество");
		ТовараНаСумму 		= Товары.Итог("Сумма");
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ЭтотОбъект.комментарий = "";
КонецПроцедуры
